52n-sos-webapp/src/main/webapp/examples/sos_v20/requests_soap/GetObs/GetObs_TP_During.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.w3.org/2003/05/soap-envelope http://www.w3.org/2003/05/soap-envelope">
	<env:Body>
		<sos:GetObservation
			service="SOS" version="2.0.0" xmlns:sos="http://www.opengis.net/sos/2.0"
			xmlns:fes="http://www.opengis.net/fes/2.0" xmlns:gml="http://www.opengis.net/gml/3.2"
			xmlns:swe="http://www.opengis.net/swe/2.0" xmlns:swes="http://www.opengis.net/swes/2.0"
			xmlns:xlink="http://www.w3.org/1999/xlink" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
			xsi:schemaLocation="http://www.opengis.net/sos/2.0
http://schemas.opengis.net/sos/2.0.0/sos.xsd">
			<sos:temporalFilter>
				<fes:During>
					<fes:ValueReference>phenomenonTime</fes:ValueReference>
					<gml:TimePeriod gml:id="tp_1">
						<gml:beginPosition>2008-04-01T17:44:15.000+02:00
						</gml:beginPosition>
						<gml:endPosition>2008-04-01T17:50:15.000+02:00</gml:endPosition>
					</gml:TimePeriod>
				</fes:During>
			</sos:temporalFilter>
		</sos:GetObservation>
	</env:Body>
</env:Envelope>